<?php

declare(strict_types=1);

return [
    // Core Messages
    'noRuleSets'      => 'هیچ مجموعه قانونی در پیکربندی اعتبارسنجی مشخص نشده است.',
    'ruleNotFound'    => '"{0}" یک قانون معتبر نیست.',
    'groupNotFound'   => '"{0}" یک گروه قوانین اعتبارسنجی نیست.',
    'groupNotArray'   => 'گروه قانون "{0}" باید یک آرایه باشد.',
    'invalidTemplate' => '"{0}" یک قالب اعتبارسنجی معتبر نیست.',

    // Rule Messages
    'alpha'                 => 'فیلد {field} فقط می‌تواند شامل حروف الفبا باشد.',
    'alpha_dash'            => 'فیلد {field} فقط می‌تواند شامل حروف الفبا، اعداد، زیرخط و خط تیره باشد.',
    'alpha_numeric'         => 'فیلد {field} فقط می‌تواند شامل حروف الفبا و اعداد باشد.',
    'alpha_numeric_punct'   => 'فیلد {field} فقط می‌تواند شامل حروف الفبا، اعداد، فاصله و کاراکترهای ~ ! # $ % & * - _ + = | : . باشد.',
    'alpha_numeric_space'   => 'فیلد {field} فقط می‌تواند شامل حروف الفبا، اعداد و فاصله باشد.',
    'alpha_space'           => 'فیلد {field} فقط می‌تواند شامل حروف الفبا و فاصله باشد.',
    'decimal'               => 'فیلد {field} باید شامل یک عدد اعشاری باشد.',
    'differs'               => 'فیلد {field} باید متفاوت از فیلد {param} باشد.',
    'equals'                => 'فیلد {field} باید دقیقاً برابر با: {param} باشد.',
    'exact_length'          => 'طول فیلد {field} باید دقیقاً {param} کاراکتر باشد.',
    'field_exists'          => 'فیلد {field} باید وجود داشته باشد.',
    'greater_than'          => 'فیلد {field} باید شامل عددی بزرگتر از {param} باشد.',
    'greater_than_equal_to' => 'فیلد {field} باید شامل عددی بزرگتر یا مساوی {param} باشد.',
    'hex'                   => 'فیلد {field} فقط می‌تواند شامل کاراکترهای هگزادسیمال باشد.',
    'in_list'               => 'فیلد {field} باید یکی از مقادیر: {param} باشد.',
    'integer'               => 'فیلد {field} باید شامل یک عدد صحیح باشد.',
    'is_natural'            => 'فیلد {field} فقط باید شامل ارقام باشد.',
    'is_natural_no_zero'    => 'فیلد {field} فقط باید شامل ارقام باشد و بزرگتر از صفر باشد.',
    'is_not_unique'         => 'فیلد {field} باید شامل مقداری باشد که قبلاً در پایگاه داده وجود دارد.',
    'is_unique'             => 'فیلد {field} باید شامل یک مقدار یکتا باشد.',
    'less_than'             => 'فیلد {field} باید شامل عددی کمتر از {param} باشد.',
    'less_than_equal_to'    => 'فیلد {field} باید شامل عددی کمتر یا مساوی {param} باشد.',
    'matches'               => 'فیلد {field} با فیلد {param} مطابقت ندارد.',
    'max_length'            => 'طول فیلد {field} نمی‌تواند بیشتر از {param} کاراکتر باشد.',
    'min_length'            => 'طول فیلد {field} باید حداقل {param} کاراکتر باشد.',
    'not_equals'            => 'فیلد {field} نمی‌تواند برابر با: {param} باشد.',
    'not_in_list'           => 'فیلد {field} نباید یکی از مقادیر: {param} باشد.',
    'numeric'               => 'فیلد {field} باید فقط شامل اعداد باشد.',
    'regex_match'           => 'فرمت فیلد {field} صحیح نیست.',
    'required'              => 'فیلد {field} الزامی است.',
    'required_with'         => 'فیلد {field} زمانی که {param} وجود دارد الزامی است.',
    'required_without'      => 'فیلد {field} زمانی که {param} وجود ندارد الزامی است.',
    'string'                => 'فیلد {field} باید یک رشته معتبر باشد.',
    'timezone'              => 'فیلد {field} باید یک منطقه زمانی معتبر باشد.',
    'valid_base64'          => 'فیلد {field} باید یک رشته base64 معتبر باشد.',
    'valid_email'           => 'فیلد {field} باید شامل یک آدرس ایمیل معتبر باشد.',
    'valid_emails'          => 'فیلد {field} باید شامل تمام آدرس‌های ایمیل معتبر باشد.',
    'valid_ip'              => 'فیلد {field} باید شامل یک آدرس IP معتبر باشد.',
    'valid_url'             => 'فیلد {field} باید شامل یک آدرس URL معتبر باشد.',
    'valid_url_strict'      => 'فیلد {field} باید شامل یک آدرس URL معتبر باشد.',
    'valid_date'            => 'فیلد {field} باید شامل یک تاریخ معتبر باشد.',
    'valid_json'            => 'فیلد {field} باید شامل یک json معتبر باشد.',

    // Credit Cards
    'valid_cc_num' => 'به نظر می‌رسد {field} یک شماره کارت اعتباری معتبر نیست.',

    // Files
    'uploaded' => 'فیلد {field} یک فایل آپلود شده معتبر نیست.',
    'max_size' => 'حجم فایل {field} بیش از حد مجاز است.',
    'is_image' => 'فیلد {field} یک فایل تصویری معتبر و آپلود شده نیست.',
    'mime_in'  => 'فیلد {field} دارای نوع MIME معتبری نیست.',
    'ext_in'   => 'فیلد {field} دارای پسوند فایل معتبری نیست.',
    'max_dims' => 'فیلد {field} یا تصویر نیست، یا عرض یا ارتفاع آن بیش از حد مجاز است.',
    'min_dims' => 'فیلد {field} یا تصویر نیست، یا عرض یا ارتفاع آن کمتر از حد مجاز است.',
];